; character mappings for the menu

macro text_mapping()
        ; -- English --
        ; Capital
        'A' = $91
        'B' = $92
        'C' = $93
        'D' = $94
        'E' = $95
        'F' = $96
        'G' = $97
        'H' = $98
        'I' = $99
        'J' = $9a
        'K' = $9b
        'L' = $9c
        'M' = $9d
        'N' = $9e
        'O' = $9f
        'P' = $A0
        'Q' = $A1
        'R' = $A2
        'S' = $A3
        'T' = $A4
        'U' = $A5
        'V' = $A6
        'W' = $A7
        'X' = $A8
        'Y' = $A9
        'Z' = $Aa

        ; Lowercase
        'a' = $Ab
        'b' = $Ac
        'c' = $Ad
        'd' = $Ae
        'e' = $Af
        'f' = $B0
        'g' = $B7
        'h' = $B1
        'i' = $B2
        'j' = $B8
        'k' = $B3
        'l' = $B4
        'm' = $B5
        'n' = $F6
        'o' = $Bc
        'p' = $Ba
        'q' = $Bb
        'r' = $Bd
        's' = $Be
        't' = $Bf
        'u' = $C0
        'v' = $C1
        'w' = $C2
        'x' = $C3
        'y' = $B9
        'z' = $C4

        ; Numbers
        '0' = $D0
        '1' = $D1
        '2' = $D2
        '3' = $D3
        '4' = $D4
        '5' = $D5
        '6' = $D6
        '7' = $D7
        '8' = $D8
        '9' = $D9

        ; Symbols / Punctuation
        ' ' = $00
        ',' = $B6
        '.' = $B6
        ''' = $C5
        '!' = $F1
        '?' = $EE
        '+' = $DE
        '-' = $4F
        '/' = $F3
        '<' = $E2
        '>' = $E3
        '★' = $E4
        '*' = $ED
        '＊' = $ED
        ':' = $EF
        '(' = $E2
        ')' = $E3
        '%' = $3C
        '$' = $3F
        '_' = $DF

        '🐇' = $DA
        '🐾' = $DB

        ; -- Japanese --
        ; Hiragana
        'あ' = $35
        'い' = $01
        'う' = $02
        'え' = $03
        'お' = $04

        'か' = $05
        'き' = $06
        'く' = $07
        'け' = $08
        'こ' = $09

        'さ' = $0A
        'し' = $0B
        'す' = $0C
        'せ' = $0D
        'そ' = $0E

        'た' = $10
        'ち' = $11
        'つ' = $12
        'て' = $13
        'と' = $14

        'な' = $15
        'に' = $16
        'ぬ' = $17
        'ね' = $18
        'の' = $19

        'は' = $1A
        'ひ' = $1B
        'ふ' = $1C
        'へ' = $1D
        'ほ' = $1E

        'ま' = $20
        'み' = $21
        'む' = $22
        'め' = $23
        'も' = $24

        'や' = $25
        'ゆ' = $26
        'よ' = $27

        'ら' = $28
        'り' = $29
        'る' = $2A
        'れ' = $2B
        'ろ' = $2C

        'わ' = $2D
        'を' = $2E
        'ん' = $2F

        ; Dakuten / Handakuten Hiragana
        'が' = $05
        'ぎ' = $06
        'ぐ' = $07
        'げ' = $08
        'ご' = $09

        'ざ' = $0A
        'じ' = $0B
        'ず' = $0C
        'ぜ' = $0D
        'ぞ' = $0E

        'だ' = $10
        'ぢ' = $11
        'づ' = $12
        'で' = $13
        'ど' = $14

        'ば' = $1A
        'び' = $1B
        'ぶ' = $1C
        'べ' = $1D
        'ぼ' = $1E

        'ぱ' = $1A
        'ぴ' = $1B
        'ぷ' = $1C
        'ぺ' = $1D
        'ぽ' = $1E

        ; Small Hiragana
        'ぁ' = $30
        'ぃ' = $31
        'ぅ' = $32
        'ぇ' = $33
        'ぉ' = $34

        'ゃ' = $36
        'ゅ' = $37
        'ょ' = $38
        'っ' = $39

        ; Katakana
        'ア' = $50
        'イ' = $51
        'ウ' = $52
        'エ' = $53
        'オ' = $54

        'カ' = $55
        'キ' = $56
        'ク' = $57
        'ケ' = $58
        'コ' = $59

        'サ' = $5A
        'シ' = $5B
        'ス' = $5C
        'セ' = $5D
        'ソ' = $5E

        'タ' = $60
        'チ' = $61
        'ツ' = $62
        'テ' = $63
        'ト' = $64

        'ナ' = $65
        'ニ' = $66
        'ヌ' = $67
        'ネ' = $68
        'ノ' = $69

        'ハ' = $6A
        'ヒ' = $6B
        'フ' = $6C
        'ヘ' = $6D
        'ホ' = $6E

        'マ' = $70
        'ミ' = $71
        'ム' = $72
        'メ' = $73
        'モ' = $74

        'ヤ' = $75
        'ユ' = $76
        'ヨ' = $77

        'ラ' = $78
        'リ' = $79
        'ル' = $7A
        'レ' = $7B
        'ロ' = $7C

        'ワ' = $7D
        'ヲ' = $7E
        'ン' = $7F

        ; Dakuten / Handakuten Katakana
        'ヴ' = $02

        'ガ' = $55
        'ギ' = $56
        'グ' = $57
        'ゲ' = $58
        'ゴ' = $59

        'ザ' = $5A
        'ジ' = $5B
        'ズ' = $5C
        'ゼ' = $5D
        'ゾ' = $5E

        'ダ' = $60
        'ヂ' = $61
        'ヅ' = $62
        'デ' = $63
        'ド' = $64

        'バ' = $6A
        'ビ' = $6B
        'ブ' = $6C
        'ベ' = $6D
        'ボ' = $6E

        'パ' = $6A
        'ピ' = $6B
        'プ' = $6C
        'ペ' = $6D
        'ポ' = $6E

        ; Small Katakana
        'ァ' = $80
        'ィ' = $81
        'ゥ' = $82
        'ェ' = $83
        'ォ' = $84

        'ャ' = $4A
        'ュ' = $4B
        'ョ' = $4C
        'ッ' = $4D

        ; Numbers
        '０' = $40
        '１' = $41
        '２' = $42
        '３' = $43
        '４' = $44
        '５' = $45
        '６' = $46
        '７' = $47
        '８' = $48
        '９' = $49

        ; Symbols / Punctuation
        '　' = $00
        '～' = $3A
        'ー' = $4F
        '、' = $3B
        '。' = $1F
        '（' = $3D
        '）' = $3E
        '／' = $6F

        
endmacro

macro tail_mapping()
        ; -- English --
        ; Capital
        'A' = $00
        'B' = $00
        'C' = $00
        'D' = $00
        'E' = $00
        'F' = $00
        'G' = $00
        'H' = $00
        'I' = $00
        'J' = $00
        'K' = $00
        'L' = $00
        'M' = $00
        'N' = $00
        'O' = $00
        'P' = $00
        'Q' = $00
        'R' = $00
        'S' = $00
        'T' = $00
        'U' = $00
        'V' = $00
        'W' = $00
        'X' = $00
        'Y' = $00
        'Z' = $00

        ; Lowercase
        'a' = $00
        'b' = $00
        'c' = $00
        'd' = $00
        'e' = $00
        'f' = $00
        'g' = $C7
        'h' = $00
        'i' = $00
        'j' = $C8
        'k' = $00
        'l' = $00
        'm' = $00
        'n' = $00
        'o' = $00
        'p' = $CA
        'q' = $CB
        'r' = $00
        's' = $00
        't' = $00
        'u' = $00
        'v' = $00
        'w' = $00
        'x' = $00
        'y' = $C9
        'z' = $00

        ; Numbers
        '0' = $00
        '1' = $00
        '2' = $00
        '3' = $00
        '4' = $00
        '5' = $00
        '6' = $00
        '7' = $00
        '8' = $00
        '9' = $00

        ; Symbols / Punctuation
        ' ' = $00
        '.' = $00
        ',' = $C6
        ''' = $00
        '!' = $00
        '?' = $00
        '+' = $00
        '-' = $00
        '/' = $00
        '<' = $00
        '>' = $00
        '★' = $00
        '*' = $00
        '＊' = $ED
        ':' = $00
        '(' = $00
        ')' = $00
        '%' = $00
        '$' = $00
        '_' = $00

        '🐇' = $00
        '🐾' = $00

        ; -- Japanese --
        ; Hiragana
        'あ' = $00
        'い' = $00
        'う' = $00
        'え' = $00
        'お' = $00

        'か' = $00
        'き' = $00
        'く' = $00
        'け' = $00
        'こ' = $00

        'さ' = $00
        'し' = $00
        'す' = $00
        'せ' = $00
        'そ' = $00

        'た' = $00
        'ち' = $00
        'つ' = $00
        'て' = $00
        'と' = $00

        'な' = $00
        'に' = $00
        'ぬ' = $00
        'ね' = $00
        'の' = $00

        'は' = $00
        'ひ' = $00
        'ふ' = $00
        'へ' = $00
        'ほ' = $00

        'ま' = $00
        'み' = $00
        'む' = $00
        'め' = $00
        'も' = $00

        'や' = $00
        'ゆ' = $00
        'よ' = $00

        'ら' = $00
        'り' = $00
        'る' = $00
        'れ' = $00
        'ろ' = $00

        'わ' = $00
        'を' = $00
        'ん' = $00

        ; Dakuten / Handakuten Hiragana
        'が' = $0F
        'ぎ' = $0F
        'ぐ' = $0F
        'げ' = $0F
        'ご' = $0F

        'ざ' = $0F
        'じ' = $0F
        'ず' = $0F
        'ぜ' = $0F
        'ぞ' = $0F

        'だ' = $0F
        'ぢ' = $0F
        'づ' = $0F
        'で' = $0F
        'ど' = $0F

        'ば' = $0F
        'び' = $0F
        'ぶ' = $0F
        'べ' = $0F
        'ぼ' = $0F

        'ぱ' = $1F
        'ぴ' = $1F
        'ぷ' = $1F
        'ぺ' = $1F
        'ぽ' = $1F

        ; Small Hiragana
        'ぁ' = $00
        'ぃ' = $00
        'ぅ' = $00
        'ぇ' = $00
        'ぉ' = $00

        'ゃ' = $00
        'ゅ' = $00
        'ょ' = $00
        'っ' = $00

        ; Katakana
        'ア' = $00
        'イ' = $00
        'ウ' = $00
        'エ' = $00
        'オ' = $00

        'カ' = $00
        'キ' = $00
        'ク' = $00
        'ケ' = $00
        'コ' = $00

        'サ' = $00
        'シ' = $00
        'ス' = $00
        'セ' = $00
        'ソ' = $00

        'タ' = $00
        'チ' = $00
        'ツ' = $00
        'テ' = $00
        'ト' = $00

        'ナ' = $00
        'ニ' = $00
        'ヌ' = $00
        'ネ' = $00
        'ノ' = $00

        'ハ' = $00
        'ヒ' = $00
        'フ' = $00
        'ヘ' = $00
        'ホ' = $00

        'マ' = $00
        'ミ' = $00
        'ム' = $00
        'メ' = $00
        'モ' = $00

        'ヤ' = $00
        'ユ' = $00
        'ヨ' = $00

        'ラ' = $00
        'リ' = $00
        'ル' = $00
        'レ' = $00
        'ロ' = $00

        'ワ' = $00
        'ヲ' = $00
        'ン' = $00

        ; Dakuten / Handakuten Katakana
        'ヴ' = $0F

        'ガ' = $0F
        'ギ' = $0F
        'グ' = $0F
        'ゲ' = $0F
        'ゴ' = $0F

        'ザ' = $0F
        'ジ' = $0F
        'ズ' = $0F
        'ゼ' = $0F
        'ゾ' = $0F

        'ダ' = $0F
        'ヂ' = $0F
        'ヅ' = $0F
        'デ' = $0F
        'ド' = $0F

        'バ' = $0F
        'ビ' = $0F
        'ブ' = $0F
        'ベ' = $0F
        'ボ' = $0F

        'パ' = $1F
        'ピ' = $1F
        'プ' = $1F
        'ペ' = $1F
        'ポ' = $1F

        ; Small Katakana
        'ァ' = $00
        'ィ' = $00
        'ゥ' = $00
        'ェ' = $00
        'ォ' = $00

        'ャ' = $00
        'ュ' = $00
        'ョ' = $00
        'ッ' = $00

        ; Numbers
        '０' = $00
        '１' = $00
        '２' = $00
        '３' = $00
        '４' = $00
        '５' = $00
        '６' = $00
        '７' = $00
        '８' = $00
        '９' = $00

        ; Symbols / Punctuation
        '　' = $00
        '～' = $00
        'ー' = $00
        '、' = $00
        '。' = $00
        '（' = $00
        '）' = $00
        
endmacro

macro text_raw(str)
  %text_mapping()
  db "<str>"
endmacro

macro tail_raw(str)
  %tail_mapping()
  db "<str>"
endmacro

macro en(str)
  %text_raw("<str>")
  db $FE
  %tail_raw("<str>")
  db $FF
endmacro

macro jp(str)
  %tail_raw("<str>")
  db $FE
  %text_raw("<str>")
  db $FF
endmacro

macro text(en_text, jp_text)
  dw ?en_label
  dw ?jp_label

  ?en_label: %en("<en_text>")
  ?jp_label: %jp("<jp_text>")
endmacro

macro en_jp_text(text)
  dw ?en_label
  dw ?jp_label

  ?en_label: %en("<text>")
  ?jp_label:
    db $FE
    %text_raw("<text>")
    db $FE, $00
    %tail_raw("<text>")
    db $FF
endmacro

macro text_with_label(en_text, jp_text, addr, display_func)
  dw ?en_label
  dw ?jp_label

  ?en_label:
    %text_raw(<str>)
    db $FE
    %tail_raw(<str>)
    db $FC
    dl <addr>
    dw <display_func>
    db $FF
  ?jp_label: %jp("<jp_text>")
    %tail_raw(<str>)
    db $FE
    %text_raw(<str>)
    db $FC
    dl <addr>
    dw <display_func>
    db $FF
endmacro

macro lang_swap_text(jp_text, en_text)
  dw ?en_label
  dw ?jp_label

  ?en_label:
    db $FD
    %jp("<jp_text>")

  ?jp_label:
    db $FE
    %text_raw("<en_text>")
    db $FE, $00
    %tail_raw("<en_text>")
    db $FF
endmacro
